artillery-quick-validation.yml
config:
  target: 'http://localhost:8003'
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Quick validation test"

  payload:
    path: "./test-data.csv"
    fields:
      - "symbol"
      - "address"  
      - "keyword"



scenarios:
  - name: "Quick Endpoint Test"
    weight: 100
    flow:
      # Test homepage
      - get:
          url: "/"
          expect:
            - statusCode: [200, 302]

      # Test load test endpoint
      - post:
          url: "/api/load-test/sentiment"
          json:
            text: "Quick test for {{ symbol }}"
            intensity: "low"
          expect:
            - statusCode: [200, 201, 422]